unload/cf/DataProcessors/кб99_НайтиПлощадки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.8">
	<DataProcessor>
		<Properties>
			<Name>кб99_НайтиПлощадки</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Регион</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВСД_Регион</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Площадки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Отметка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Активная</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Площадка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВСД_Площадка</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Адрес</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>GUID</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>UUID</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>GUIDХозСубъекта</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХозСубъект</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВСД_ХозСубъект</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

unload/cf/Catalogs/ВСД_Площадка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.8">
	<Catalog>
		<Properties>
			<Name>ВСД_Площадка</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>GUID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>UUID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Адрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>GuidХозСубъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПлощадки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХозСубъект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВСД_ХозСубъект</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Страна</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВСД_Страна</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Регион</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВСД_Регион</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВСД_Район</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Город</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВСД_Город</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаселенныйПункт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВСД_НаселенныеПункты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Улица</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВСД_Улица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДома</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Активен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПарамКолонкаСортировкиПартииСписания</Name>
					<Comment>Сортировка Актуальных Партий</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПарамЗнакСортировкиУбывание</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПерсональныеПараметрыСписанияПартий</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаАктуальностиПартий</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИгнорироватьПриГрупповомГашении</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусРегистрации</Name>
					<Comment>Статус предприятия в реестре ИС Цербер.</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.кб99_СтатусПлощадки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Склады</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Склад</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

unload/cf/DataProcessors/кб99_НайтиПлощадки/Forms/ФормаЗагрузкаПлощадокУФ/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Объект.Организация = кб99_ВСД_Общий.ПолучитьОрганизациюПоУмолчанию();	
	ПараметрыОрганизации = кб99_ВСД.ЗагрузитьПараметры( Объект.Организация );		
	кб99_ВСД.ЗагрузитьПараметрыВОбработку( Объект, ПараметрыОрганизации ); 			
	
	Попытка	ВыбХозСубъект = Параметры.ВыбХозСубъект; Исключение КонецПопытки;
	Попытка	
		ВыбРегион = Параметры.ВыбРегион;	
	Исключение 	
		ВыбРегион = объект.Регион;
	КонецПопытки;
	Попытка	
		НазваниеПлощадки = Параметры.ВыбНазвание;	
	Исключение 	
		НазваниеПлощадки = ВыбХозСубъект.Наименование;	
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Объект.Площадки.Очистить();
		
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	СтандартнаяОбработка         = Ложь;
	Объект.Площадки.Очистить();
	
КонецПроцедуры
//*******************  Открытие/Закрыте формы окончание

&НаКлиенте
Процедура кнОтметитьВсеДокументы(Команда)
	
	Для Каждого стр Из объект.Площадки Цикл
		Если стр.Активная Тогда
			стр.Отметка = Истина;
		Иначе
			стр.Отметка = Ложь;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура кнСнятьОтметкиДокументов(Команда)
	
	Для Каждого стр Из объект.Площадки Цикл
		стр.Отметка = Ложь;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура кнВыполнитьПоискСервер( СписокУсловий )
	
	ПараметрыОрганизации = кб99_ВСД.ЗагрузитьПараметры( Объект.Организация );
	
	МассивПлощадок = кб99_ВСД_Запросы.Площадки_ЗагрузитьПоУсловиям( ПараметрыОрганизации, СписокУсловий );
	
	Объект.Площадки.Очистить();
	Для Каждого строкаПлощадка Из МассивПлощадок Цикл
		НоваяСтрока = Объект.Площадки.Добавить();
		ЗаполнитьЗначенияСвойств( НоваяСтрока, строкаПлощадка );
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура кнВыполнитьПоиск(Команда)
	
	СписокУсловий = Новый Соответствие;
	СписокУсловий.Вставить( "ХозСубъект", ВыбХозСубъект );
	СписокУсловий.Вставить( "Регион", ВыбРегион );
	СписокУсловий.Вставить( "Название", НазваниеПлощадки );	
	
	Состояние("Выполняется загрузка Площадок",,"Ожидайте...",БиблиотекаКартинок.kb99_wrench);
	кнВыполнитьПоискСервер( СписокУсловий );
	ПоказатьОповещениеПользователя("Выполнено");
	
КонецПроцедуры

&НаСервере
Процедура кнСохранитьНаСервере()
	
	Для Каждого строкаПлощадка Из Объект.Площадки Цикл
		Если строкаПлощадка.Отметка Тогда 
			Спр = Новый("СправочникМенеджер.ВСД_Площадка");
			Если строкаПлощадка.Площадка = Справочники.ВСД_Площадка.ПустаяСсылка() Тогда 
				Объект_ВСД_Площадка = Справочники.ВСД_Площадка.СоздатьЭлемент();
			Иначе
				Объект_ВСД_Площадка = строкаПлощадка.Площадка.ПолучитьОбъект(); 
			КонецЕсли;
			Объект_ВСД_Площадка.Наименование = строкаПлощадка.Наименование;
			Объект_ВСД_Площадка.Адрес = строкаПлощадка.Адрес;
			Объект_ВСД_Площадка.GUID = строкаПлощадка.GUID;
			Объект_ВСД_Площадка.UUID = строкаПлощадка.uuid;	
			Объект_ВСД_Площадка.GUIDХозСубъекта = строкаПлощадка.ХозСубъект.GUID;
			Объект_ВСД_Площадка.ХозСубъект = строкаПлощадка.ХозСубъект;
			Объект_ВСД_Площадка.Записать();
			строкаПлощадка.Площадка = Объект_ВСД_Площадка.Ссылка;
			Сообщить("Записан ВСД_Площадка ["+Объект_ВСД_Площадка+"] GUID = "+ строкаПлощадка.Guid);				
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура кнСохранитьОтвет(Ответ,Парам) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		Состояние("Выполняется запись Площадок",,"Ожидайте...",БиблиотекаКартинок.kb99_wrench);
		кнСохранитьНаСервере();
		ПоказатьОповещениеПользователя("Выполнено");
	КонецЕсли;
	
КонецПроцедуры
 
&НаКлиенте
Процедура кнСохранить(Команда)
	
	Оповещение = Новый ОписаниеОповещения("кнСохранитьОтвет",ЭтаФорма);	
    ПоказатьВопрос(Оповещение, "Записать отмеченные?", РежимДиалогаВопрос.ДаНет,  0, КодВозвратаДиалога.Да, "");
	
КонецПроцедуры
